Autodesk.Revit.DB.DetailElementOrderUtils.AreDetailElements(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Indicates if the elements are all detail elements that participate in detail draw ordering in the view.
document:
The document.
view:
The view in which the details appear.
detailElementIds:
The details to check.
Returns:
True if the detail elements are orderable in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.IsDetailElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Indicates if the element is a detail element that participates in detail draw ordering in the view.
document:
The document.
view:
The view in which the detail appears.
detailElementId:
The detail element.
Returns:
True if the detail element is orderable in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.GetDrawOrderForDetails(Autodesk.Revit.DB.View,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Returns the given detail elements according to the currently specified draw order for the detail elements in a given view.
Remarks:
The sort order is from back to front, with earlier elements drawing first and appearing under later elements.
view:
The view in which the details appear.
detailIdsToSort:
The detail to be sorted by draw order.
Returns:
The detail ids sorted from back to front, with earlier elements drawing first and appearing under later elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
detailIdsToSort is empty or it contains elements are not visible in the view.
-or-
detailIdsToSort is empty or it contains elements that do not participate in detail draw ordering. Details must be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DetailElementOrderUtils.SendBackward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Moves the given detail instances one step closer to the back with relation to all other detail
instances in the view, while keeping the order of the given ones.
document:
The document.
view:
The view in which the details appear.
detailElementIds:
The details to move backward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
detailElementIds is empty or it contains elements that do not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.SendBackward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Moves the given detail instance one step closer to the back of all other detail instances in the view.
document:
The document.
view:
The view in which the detail appears.
detailElementId:
The detail to move backward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
The element detailElementId is not a detail or it does not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.SendToBack(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Places the given detail instances behind all other detail instances in the view, while keeping
the order of the given ones.
document:
The document.
view:
The view in which the details appear.
detailElementIds:
The details to send to back.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
detailElementIds is empty or it contains elements that do not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.SendToBack(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Places the given detail instance behind all detail instances in the view.
document:
The document.
view:
The view in which the detail appears.
detailElementId:
The detail to send to back.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
The element detailElementId is not a detail or it does not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.BringForward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Moves the given detail instances one step closer to the front of all other detail instances in the view,
while keeping the order of the given ones.
document:
The document.
view:
The view in which the details appear.
detailElementIds:
The details to bring forward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
detailElementIds is empty or it contains elements that do not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.BringForward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Moves the given detail instance one step closer to the front of all other detail instances in the view.
document:
The document.
view:
The view in which the detail appears.
detailElementId:
The detail to bring forward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
The element detailElementId is not a detail or it does not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.BringToFront(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Places the given detail instances in the front of all other detail instances in the view, while
keeping the order of the given ones.
document:
The document.
view:
The view in which the details appear.
detailElementIds:
The details to bring to front.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
detailElementIds is empty or it contains elements that do not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.BringToFront(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Places the given detail instance in the front of all other detail instances in the view.
document:
The document.
view:
The view in which the detail appears.
detailElementId:
The detail element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not support detail draw order.  Only projects and 3d families support draw order.  2d families and in-place families do not support draw order.
-or-
The element detailElementId is not a detail or it does not participate in detail draw ordering. Details must be visible in the view.
-or-
In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils
A utility class that arranges the draw order of the detail elements.
Since:
2013